In [18]:
# import numpy library as np
import numpy as np

# import pandas library as pd
import pandas as pd


# List of Tuples
students = [('Ankit', 22, 'Up', 'Geu'),
		('Ankita', np.NaN, 'Delhi', np.NaN),
		('Rahul', 16, 'Tokyo', 'Abes'),
		('Simran', 41, 'Delhi', 'Gehu'),
		('Shaurya', np.NaN, 'Delhi', 'Geu'),
		('Shivangi', 35, 'Mumbai', np.NaN ),
		('Swapnil', 35, np.NaN, 'Geu'),
		(np.NaN, 35, 'Uk', 'Geu'),
		('Jeet', 35, 'Guj', 'Gehu'),
		(np.NaN, np.NaN, np.NaN, np.NaN)
			]

# Create a DataFrame object from
# list of tuples with columns
# and indices.
details = pd.DataFrame(students, columns =['Name', 'Age',
										'Place', 'College'],
						index =['a', 'b', 'c', 'd', 'e',
								'f', 'g', 'i', 'j', 'k'])

print(details)
# show the boolean dataframe			
print(" \nshow the boolean Dataframe : \n\n", details.isnull())

# index attribute of a dataframe
# gives index list

# Count total NaN at each row in a DataFrame
for i in range(len(details.index)) :
	print(" Total NaN in row", i + 1, ":", details.iloc[i].isnull().sum())

# Count total NaN in numbers and as a percentage in at each row in a DataFrame
for i in range(len(details.index)) :
    #percentage = 100*(details.iloc[i].isnull().sum())/4
    #if percentage>=75.0:
        #print (percentage)
        print(" Total NaN in row", i + 1, ":", details.iloc[i].isnull().sum(), "or", 100*(details.iloc[i].isnull().sum())/4,"%")

       Name   Age   Place College
a     Ankit  22.0      Up     Geu
b    Ankita   NaN   Delhi     NaN
c     Rahul  16.0   Tokyo    Abes
d    Simran  41.0   Delhi    Gehu
e   Shaurya   NaN   Delhi     Geu
f  Shivangi  35.0  Mumbai     NaN
g   Swapnil  35.0     NaN     Geu
i       NaN  35.0      Uk     Geu
j      Jeet  35.0     Guj    Gehu
k       NaN   NaN     NaN     NaN

show the boolean Dataframe :

     Name    Age  Place  College
a  False  False  False    False
b  False   True  False     True
c  False  False  False    False
d  False  False  False    False
e  False   True  False    False
f  False  False  False     True
g  False  False   True    False
i   True  False  False    False
j  False  False  False    False
k   True   True   True     True
 Total NaN in row 1 : 0
 Total NaN in row 2 : 2
 Total NaN in row 3 : 0
 Total NaN in row 4 : 0
 Total NaN in row 5 : 1
 Total NaN in row 6 : 1
 Total NaN in row 7 : 1
 Total NaN in row 8 : 1
 Total NaN in row 9 : 0
 Total NaN in row 10 : 4
 Total NaN in row 1 : 0 or 0.0 %
 Total NaN in row 2 : 2 or 50.0 %
 Total NaN in row 3 : 0 or 0.0 %
 Total NaN in row 4 : 0 or 0.0 %
 Total NaN in row 5 : 1 or 25.0 %
 Total NaN in row 6 : 1 or 25.0 %
 Total NaN in row 7 : 1 or 25.0 %
 Total NaN in row 8 : 1 or 25.0 %
 Total NaN in row 9 : 0 or 0.0 %
 Total NaN in row 10 : 4 or 100.0 %

In [19]:
# Count total NaN in a DataFrame
print(" \nCount total NaN in a DataFrame : \n\n",
       details.isnull().sum().sum())

Count total NaN in a DataFrame :

 10

In [20]:
details

       Name   Age   Place College
a     Ankit  22.0      Up     Geu
b    Ankita   NaN   Delhi     NaN
c     Rahul  16.0   Tokyo    Abes
d    Simran  41.0   Delhi    Gehu
e   Shaurya   NaN   Delhi     Geu
f  Shivangi  35.0  Mumbai     NaN
g   Swapnil  35.0     NaN     Geu
i       NaN  35.0      Uk     Geu
j      Jeet  35.0     Guj    Gehu
k       NaN   NaN     NaN     NaN

In [21]:
#making new dataframe with dropped NA values
details2=details.dropna(axis=0, how='any')

In [22]:
details2

     Name   Age  Place College
a   Ankit  22.0     Up     Geu
c   Rahul  16.0  Tokyo    Abes
d  Simran  41.0  Delhi    Gehu
j    Jeet  35.0    Guj    Gehu

In [23]:
details2.index

Index(['a', 'c', 'd', 'j'], dtype='object')

In [26]:
df= pd.DataFrame(details.isnull().any(axis=1))
print(df)

       0
a  False
b   True
c  False
d  False
e   True
f   True
g   True
i   True
j  False
k   True

In [25]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'i', 'j', 'k'], dtype='object')